app/views/recipes/new.html.erb

SELECT `difficulties`.* FROM `difficulties`
---
    <%= f.label :difficulty_id, "難易度" %>
    <%= f.collection_select :difficulty_id, Difficulty.all, :id, :name, { prompt: "選択してください" }, class: "form-control" %>

SELECT `base_liquors`.* FROM `base_liquors`
---
    <%= f.label :base_liqour_id, "ベースのお酒" %>
    <%= f.collection_select :base_liquor_id, BaseLiquor.all, :id, :name, { prompt: "選択して下さい" }, class: "font-control" %>

SELECT `recipes`.`name`, `recipes`.`id` FROM `recipes` WHERE `recipes`.`official` = TRUE
---
    <%= f.label :parent_recipe_id, "親カクテル" %>
    <%= f.select :parent_recipe_id, Recipe.where(official: true).pluck(:name, :id), { include_blank: "選択してください" }, class: "form-select" %>

SELECT `ingredients`.* FROM `ingredients`
---
        <%= ingredient_form.label :ingredient_id, "材料" %>
        <%= ingredient_form.collection_select :ingredient_id, Ingredient.all, :id, :name, { prompt: "選択してください" }, class: "form-control" %>