app/views/recipes/show.html.erb

SELECT `ingredients`.* FROM `ingredients` INNER JOIN `recipe_ingredients` ON `ingredients`.`id` = `recipe_ingredients`.`ingredient_id` WHERE `recipe_ingredients`.`recipe_id` = 1
---
    <p><strong>副材料:</strong>
      <% @recipe.ingredients.each do |ingredient| %>