app/views/shared/_search.html.erb

SELECT `base_liquors`.* FROM `base_liquors`
---
    <%= f.label :base_liquor_id_eq, "ベースのお酒" %>
    <%= f.select :base_liquor_id_eq, options_from_collection_for_select(BaseLiquor.all, :id, :name), { prompt: "選択してください" }, class: "form-select" %>

SELECT `difficulties`.* FROM `difficulties`
---
    <%= f.label :difficulty_id_eq, "難易度" %>
    <%= f.select :difficulty_id_eq, options_from_collection_for_select(Difficulty.all, :id, :name), { prompt: "選択してください" }, class: "form-select" %>