app/controllers/recipes_controller.rb

SELECT `base_liquors`.* FROM `base_liquors` WHERE `base_liquors`.`id` IN (6, 7)
SELECT `difficulties`.* FROM `difficulties` WHERE `difficulties`.`id` IN (6, 7)
SELECT `ingredients`.* FROM `ingredients` WHERE `ingredients`.`id` IN (8, 9, 10, 11)
SELECT `recipes`.* FROM `recipes` WHERE (`recipes`.`base_liquor_id` = 1 AND `recipes`.`difficulty_id` = 1)
---
  def index
    @q = Recipe.ransack(params[:q] || {})  # 空のparams[:q]に対応
    @recipes = @q.result.includes(:difficulty, :base_liquor, :ingredients)

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1
---
  def show
    @recipe = Recipe.find(params[:id])

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1
---
    def set_recipe
      @recipe = Recipe.find(params[:id])